In [69]:
import pandas as pd 
import numpy as np

In [91]:
d={
    "student1": [
        "view_grades",
        "view_classes"
    ],
    "student2": [
        "view_grades",
        "view_classes"
    ],
    "teacher": [
        "view_grades",
        "change_grades",
        "add_grades",
        "delete_grades",
        "view_classes"
    ],
    "principle": [
        "view_grades",
        "view_classes",
        "change_classes",
        "add_classes",
        "delete_classes"
    ]
}

In [ ]:
# create col and row

In [92]:
l=list(d.values())

In [93]:
row=list(d.keys())

In [138]:
col=[]
for i in l:
    col=list(set().union(s,i))

In [ ]:
# create a datafram

In [95]:
col

['add_grades',
 'view_grades',
 'delete_grades',
 'add_classes',
 'change_grades',
 'delete_classes',
 'view_classes',
 'change_classes']

In [137]:
row

['student1', 'student2', 'teacher', 'principle']

In [143]:
df = pd.DataFrame(columns=col, index=row)

In [144]:
df

,add_grades,view_grades,delete_grades,add_classes,change_grades,delete_classes,view_classes,change_classes
student1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
student2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
teacher,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
principle,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [145]:
for r in row:
    a=list(set(d[r]).intersection(col))
    b=np.repeat(1, len(a))
    dictionary = dict(zip(a, b))
    df.loc[r] = pd.Series(dictionary)

In [146]:
df

,add_grades,view_grades,delete_grades,add_classes,change_grades,delete_classes,view_classes,change_classes
student1,NaN,1,NaN,NaN,NaN,NaN,1,NaN
student2,NaN,1,NaN,NaN,NaN,NaN,1,NaN
teacher,1,1,1,NaN,1,NaN,1,NaN
principle,NaN,1,NaN,1,NaN,1,1,1

In [147]:
df=df.fillna(0)
df = df.astype(int)

In [149]:
df

,add_grades,view_grades,delete_grades,add_classes,change_grades,delete_classes,view_classes,change_classes
student1,0,1,0,0,0,0,1,0
student2,0,1,0,0,0,0,1,0
teacher,1,1,1,0,1,0,1,0
principle,0,1,0,1,0,1,1,1

In [151]:
df.to_csv('result.csv')